DeqingSun/arduino_core_ch32/libraries/SimpleUsbSerial/src/USBhandler.c
// clang-format off
#include "USBhandler.h"
// clang-format on

// CDC functions:
void resetCDCParameters();
void setLineCodingHandler();
uint16_t getLineCodingHandler();
void setControlLineStateHandler();
void USB_EP2_IN();
void USB_EP2_OUT();

// clang-format off
//end point ram
#if !defined (CH585)
__attribute__((aligned(4))) uint8_t Ep0Buffer[8];
__attribute__((aligned(4))) uint8_t Ep1Buffer[8];
__attribute__((aligned(4))) uint8_t Ep2Buffer[128];
#else
__attribute__((aligned(16))) uint8_t Ep0Buffer[DEF_USBD_UEP0_SIZE];
__attribute__((aligned(16))) uint8_t Ep1Buffer[DEF_USBD_UEP1_SIZE];
__attribute__((aligned(16))) uint8_t Ep2Buffer[DEF_USBD_UEP2_SIZE*2];
#endif
// clang-format on

uint16_t SetupLen;
uint8_t SetupReq;
volatile uint8_t UsbConfig;
#if defined (CH585)
volatile uint8_t UsbDevSpeed;
#endif

uint8_t *pDescr;

void NOP_Process(void) {}

void USBInitForCdc() {

#if defined (CH573) || defined (CH572)
  R8_USB_CTRL = 0x00;
#elif defined (CH585)
  R8_USB2_CTRL = 0x00;
  R8_USBHS_PLL_CTRL = USBHS_PLL_EN;
  R16_PIN_CONFIG |= RB_PIN_USB2_EN;
  R16_U2EP_TX_EN = 0;
  R16_U2EP_RX_EN = 0;
#elif defined (CH32X035)
  USBFSD->BASE_CTRL = 0x00;
#endif

  // Manual flip, OUT transaction returns
  // ACK, IN transaction returns NAK
#if defined (CH573) || defined (CH572)
  R8_UEP0_CTRL = UEP_R_RES_ACK | UEP_T_RES_NAK;
#elif defined (CH585)
  R16_U2EP_TX_EN |= RB_EP0_EN;
  R16_U2EP_RX_EN |= RB_EP0_EN;
  R32_U2EP0_MAX_LEN  = DEF_USBD_UEP0_SIZE;
  R16_U2EP0_T_LEN  = 0;
  R8_U2EP0_TX_CTRL = USBHS_UEP_T_RES_NAK;
  R8_U2EP0_RX_CTRL = USBHS_UEP_R_RES_ACK;
#elif defined (CH32X035)
  USBFSD->UEP0_CTRL_H = USBFS_UEP_R_RES_ACK | USBFS_UEP_T_RES_NAK;
#endif

  // Endpoint 1, single 64 bytes send buffer
#if defined (CH573) || defined (CH572)
  R8_UEP4_1_MOD = RB_UEP1_TX_EN;
#elif defined (CH585)
  R16_U2EP_TX_EN |= RB_EP1_EN;
  R16_U2EP_RX_EN |= RB_EP1_EN;
  R32_U2EP1_MAX_LEN = DEF_USBD_UEP1_SIZE;
  R16_U2EP1_T_LEN = 0;
#elif defined (CH32X035)
  USBFSD->UEP4_1_MOD = USBFS_UEP1_TX_EN;
#endif
  // Endpoint 1 automatically flips the sync flag,
  // IN transaction returns NAK
#if defined (CH573) || defined (CH572)
  R8_UEP1_CTRL = RB_UEP_AUTO_TOG | UEP_T_RES_NAK;
#elif defined (CH585)
  R8_U2EP1_TX_CTRL = USBHS_UEP_T_RES_NAK;
#elif defined (CH32X035)
  USBFSD->UEP1_CTRL_H = USBFS_UEP_T_AUTO_TOG | USBFS_UEP_T_RES_NAK;
#endif

  // Endpoint 2, single 64 bytes receive buffer, single 64 bytes send buffer
#if defined (CH573) || defined (CH572)
  R8_UEP2_3_MOD = RB_UEP2_RX_EN | RB_UEP2_TX_EN;
#elif defined (CH585)
  R16_U2EP_TX_EN |= RB_EP2_EN;
  R16_U2EP_RX_EN |= RB_EP2_EN;
  R32_U2EP2_MAX_LEN = DEF_USBD_UEP2_SIZE;
  R16_U2EP2_T_LEN = 0;
#elif defined (CH32X035)
  USBFSD->UEP2_3_MOD = USBFS_UEP2_RX_EN | USBFS_UEP2_TX_EN;
#endif
  // Endpoint 2 automatically flips the sync flag, IN
  // transaction returns NAK, OUT transaction returns ACK
#if defined (CH573) || defined (CH572)
  R8_UEP2_CTRL = RB_UEP_AUTO_TOG | UEP_T_RES_NAK | UEP_R_RES_ACK;
#elif defined (CH585)
  R8_U2EP2_TX_CTRL = USBHS_UEP_T_RES_NAK;
  R8_U2EP2_RX_CTRL = USBHS_UEP_R_RES_ACK;
#elif defined (CH32X035)
  USBFSD->UEP2_CTRL_H = USBFS_UEP_T_AUTO_TOG | USBFS_UEP_T_RES_NAK | USBFS_UEP_R_RES_ACK;
#endif

#if defined (CH573) || defined (CH572)
  R16_UEP0_DMA = (uint16_t)(uint32_t)&Ep0Buffer[0];
  R16_UEP1_DMA = (uint16_t)(uint32_t)&Ep1Buffer[0];
  R16_UEP2_DMA = (uint16_t)(uint32_t)&Ep2Buffer[0];
#elif defined (CH585)
  R32_U2EP0_DMA = (uint32_t)&Ep0Buffer[0];  //R32_U2EP0_DMA only has low 17 bit
  R32_U2EP1_RX_DMA = (uint32_t)&Ep1Buffer[0];
  R32_U2EP2_RX_DMA = (uint32_t)&Ep2Buffer[0];
  R32_U2EP2_TX_DMA = (uint32_t)&Ep2Buffer[DEF_USBD_UEP2_SIZE];
#elif defined (CH32X035)
  USBFSD->UEP0_DMA = (uint32_t)&Ep0Buffer[0];
  USBFSD->UEP1_DMA = (uint32_t)&Ep1Buffer[0];
  USBFSD->UEP2_DMA = (uint32_t)&Ep2Buffer[0];
#endif

  // clear interrupt flag
#if defined (CH573) || defined (CH572)
  R8_USB_INT_FG = 0xFF;
#elif defined (CH32X035)
  USBFSD->INT_FG = 0xff;
#endif

  // Device address initialization
#if defined (CH573) || defined (CH572)
  R8_USB_DEV_AD = 0x00;
#elif defined (CH32X035)
  USBFSD->DEV_ADDR = 0x00;
#endif
  // USB device and internal pull-up enable,
  // automatically return to NAK before interrupt flag
  // is cleared during interrupt
#if defined (CH573) || defined (CH572)
  R8_USB_CTRL = RB_UC_DEV_PU_EN | RB_UC_INT_BUSY | RB_UC_DMA_EN;
  R8_UDEV_CTRL = RB_UD_PD_DIS | RB_UD_PORT_EN;
#if defined (CH572)
  // The CH572 will pull up the USB lines if RB_PIN_DEBUG_EN is set,
  R16_PIN_ALTERNATE &= ~RB_PIN_DEBUG_EN;
#endif
#elif defined (CH585)
  R8_USB2_CTRL = USBHS_UD_RST_LINK | USBHS_UD_PHY_SUSPENDM;            
  R8_USB2_BASE_MODE = USBHS_UD_SPEED_HIGH;
  R8_USB2_CTRL = USBHS_UD_DEV_EN | USBHS_UD_DMA_EN | USBHS_UD_LPM_EN | USBHS_UD_PHY_SUSPENDM;
#elif defined (CH32X035)
  USBFSD->BASE_CTRL = USBFS_UC_DEV_PU_EN | USBFS_UC_INT_BUSY | USBFS_UC_DMA_EN;
  USBFSD->UDEV_CTRL = USBFS_UD_PD_DIS | USBFS_UD_PORT_EN;
#endif

  // enable interrupt
#if defined (CH573) || defined (CH572)
  R8_USB_INT_EN = RB_UIE_SUSPEND | RB_UIE_BUS_RST | RB_UIE_TRANSFER;
  PFIC_EnableIRQ(USB_IRQn);
#elif defined (CH585)
  R8_USB2_INT_EN = USBHS_UDIE_BUS_RST | USBHS_UDIE_SUSPEND | USBHS_UDIE_BUS_SLEEP | USBHS_UDIE_LPM_ACT | USBHS_UDIE_TRANSFER | USBHS_UDIE_LINK_RDY;      
  PFIC_EnableIRQ( USB2_DEVICE_IRQn );
#elif defined (CH32X035)
  USBFSD->INT_EN = USBFS_UIE_SUSPEND | USBFS_UIE_BUS_RST | USBFS_UIE_TRANSFER;
  NVIC_EnableIRQ( USBFS_IRQn );
#endif
}

void USB_EP0_SETUP() {
#if defined (CH573) || defined (CH572)
  uint8_t len = R8_USB_RX_LEN;
  len = 8;    //CH573 USB setup packet does not affect R8_USB_RX_LEN. So just force it to 8
#elif defined (CH585)
  uint16_t len = R16_U2EP0_RX_LEN;
#elif defined (CH32X035)
  uint8_t len = USBFSD->RX_LEN;
  len = 8;    //Although not specified in the datasheet, setup packet length seems not correct in CH32X035 either
#endif

  if (len == (sizeof(USB_SETUP_REQ_t))) {
    SetupLen = ((uint16_t)UsbSetupBuf->wLengthH << 8) | (UsbSetupBuf->wLengthL);
    len = 0; // Default is success and upload 0 length
    SetupReq = UsbSetupBuf->bRequest;
    if ((UsbSetupBuf->bRequestType & USB_REQ_TYP_MASK) !=
        USB_REQ_TYP_STANDARD) // Not standard request
    {

      // here is the commnunication starts, refer to usbFunctionSetup of USBtiny
      // or usb_setup in usbtiny

      switch ((UsbSetupBuf->bRequestType & USB_REQ_TYP_MASK)) {
      case USB_REQ_TYP_VENDOR: {
        switch (SetupReq) {
        default:
          len = 0xFF; // command not supported
          break;
        }
        break;
      }
      case USB_REQ_TYP_CLASS: {
        switch (SetupReq) {
        case GET_LINE_CODING: // 0x21  currently configured
          len = getLineCodingHandler();
          break;
        case SET_CONTROL_LINE_STATE: // 0x22  generates RS-232/V.24 style
                                      // control signals
          setControlLineStateHandler();
          break;
        case SET_LINE_CODING: // 0x20  Configure
          break;

        default:
          len = 0xFF; // command not supported
          break;
        }
        break;
      }
      default:
        len = 0xFF; // command not supported
        break;
      }

