DeqingSun/arduino_core_ch32/libraries/SimpleUsbSerial/src/USBhandler.c
    } else // Standard request
    {
      switch (SetupReq) // Request ccfType
      {
      case USB_GET_DESCRIPTOR:
        switch (UsbSetupBuf->wValueH) {
        case 1: // Device Descriptor
          pDescr = DevDesc; // Put Device Descriptor into outgoing buffer
          len = DevDescLen;
          break;
        case 2: // Configure Descriptor
          #if defined (CH585)
          if( R8_USB2_MIS_ST & USBHS_UDMS_HS_MOD ) {
            UsbDevSpeed = USBHS_SPEED_HIGH;
            //USBHS_DevMaxPackLen = DEF_USBD_HS_PACK_SIZE;
            pDescr = CfgHsDesc;
            len = CfgHsDescLen;
          } else {
            /* Full speed mode */
            UsbDevSpeed = USBHS_SPEED_FULL;
            //USBHS_DevMaxPackLen = DEF_USBD_FS_PACK_SIZE;
            pDescr = DevDesc; // Put Device Descriptor into outgoing buffer
            len = DevDescLen;
          }
          #else
          pDescr = CfgDesc;
          len = CfgDescLen;
          #endif
          break;
        case 3: //get usb string descriptor
          if (UsbSetupBuf->wValueL == 0) {
            pDescr = LangDes;
            len = LangDesLen;
          } else if (UsbSetupBuf->wValueL == 1) {
            pDescr = Manuf_Des;
            len = Manuf_DesLen;
          } else if (UsbSetupBuf->wValueL == 2) {
              pDescr = Prod_Des;
              len = Prod_DesLen;
          } else if (UsbSetupBuf->wValueL == 3) {
              pDescr = SerDes;
              len = SerDesLen;
          } else if (UsbSetupBuf->wValueL == 4) {
              pDescr = CDC_Des;
              len = CDC_DesLen;
          } else {
              pDescr = SerDes;
              len = SerDesLen;
          }
          break;
        #if defined (CH585)
        case 6: //get usb device qualify descriptor
          pDescr = QualDesc;
          len = QualDescLen;
          break;
        case 7: //get usb other speed config descriptor
          if( UsbDevSpeed == USBHS_SPEED_HIGH ) {
              /* High speed mode */
              memcpy( &CfgOtherDesc[2], &CfgDesc[2], CfgDescLen - 2 );
              pDescr = CfgOtherDesc;
              len = CfgDescLen;
          } else if( UsbDevSpeed == USBHS_SPEED_FULL ) {
              /* Full speed mode */
              memcpy( &CfgOtherDesc[2], &CfgHsDesc[2], CfgHsDescLen - 2 );
              pDescr = CfgOtherDesc;
              len = CfgHsDescLen;
          } else {
              len = 0xFF;
          }
          break;
        #endif
        default:
          len = 0xff; // Unsupported descriptors or error
          break;
        }
        if (len != 0xff) {
          if (SetupLen > len) {
            SetupLen = len; // Limit length
          }
          len = SetupLen >= DEFAULT_ENDP0_SIZE
                    ? DEFAULT_ENDP0_SIZE
                    : SetupLen; // transmit length for this packet
          for (uint8_t i = 0; i < len; i++) {
            Ep0Buffer[i] = pDescr[i];
          }
          SetupLen -= len;
          pDescr += len;
        }
        break;
      case USB_SET_ADDRESS:
        SetupLen = UsbSetupBuf->wValueL; // Save the assigned address
        break;
      case USB_GET_CONFIGURATION:
        Ep0Buffer[0] = UsbConfig;
        if (SetupLen >= 1) {
          len = 1;
        }
        break;
      case USB_SET_CONFIGURATION:
        UsbConfig = UsbSetupBuf->wValueL;
        break;
      case USB_GET_INTERFACE:
        break;
      case USB_SET_INTERFACE:
        break;
      case USB_CLEAR_FEATURE: // Clear Feature
        if ((UsbSetupBuf->bRequestType & 0x1F) ==
            USB_REQ_RECIP_DEVICE) // Clear the device featuee.
        {
          if ((((uint16_t)UsbSetupBuf->wValueH << 8) | UsbSetupBuf->wValueL) ==
              0x01) {
            if (CfgDesc[ 7 ] & 0x20) {
              // wake up
            } else {
              len = 0xFF; // Failed
            }
          } else {
            len = 0xFF; // Failed
          }
        } else if ((UsbSetupBuf->bRequestType & USB_REQ_RECIP_MASK) ==
                    USB_REQ_RECIP_ENDP) // endpoint
        {
          switch (UsbSetupBuf->wIndexL) {
            case 0x84:
              #if defined (CH573) || defined (CH572)
              R8_UEP4_CTRL = R8_UEP4_CTRL & ~(RB_UEP_T_TOG | MASK_UEP_T_RES) | UEP_T_RES_NAK;
              #elif defined (CH585)
              R8_U2EP4_TX_CTRL = USBHS_UEP_T_RES_NAK;
              #elif defined (CH32X035)
              USBFSD->UEP4_CTRL_H = USBFSD->UEP4_CTRL_H & ~ (USBFS_UEP_T_TOG | USBFS_UEP_T_RES_MASK) | USBFS_UEP_T_RES_NAK;
              #endif
            break;
            case 0x04:
              #if defined (CH573) || defined (CH572)
              R8_UEP4_CTRL = R8_UEP4_CTRL & ~(RB_UEP_R_TOG | MASK_UEP_R_RES) | UEP_R_RES_ACK;
              #elif defined (CH585)
              R8_U2EP4_RX_CTRL = USBHS_UEP_R_RES_ACK;
              #elif defined (CH32X035)
              USBFSD->UEP4_CTRL_H = USBFSD->UEP4_CTRL_H & ~(USBFS_UEP_R_TOG | USBFS_UEP_R_RES_MASK) | USBFS_UEP_R_RES_ACK;
              #endif
            break;
            case 0x83:
              #if defined (CH573) || defined (CH572)
              R8_UEP3_CTRL = R8_UEP3_CTRL & ~(RB_UEP_T_TOG | MASK_UEP_T_RES) | UEP_T_RES_NAK;
              #elif defined (CH585)
              R8_U2EP3_TX_CTRL = USBHS_UEP_T_RES_NAK;
              #elif defined (CH32X035)
              USBFSD->UEP3_CTRL_H = USBFSD->UEP3_CTRL_H & ~(USBFS_UEP_T_TOG | USBFS_UEP_T_RES_MASK) | USBFS_UEP_T_RES_NAK;
              #endif
            break;
            case 0x03:
              #if defined (CH573) || defined (CH572)
              R8_UEP3_CTRL = R8_UEP3_CTRL & ~(RB_UEP_R_TOG | MASK_UEP_R_RES) | UEP_R_RES_ACK;
              #elif defined (CH585)
              R8_U2EP3_RX_CTRL = USBHS_UEP_R_RES_ACK;
              #elif defined (CH32X035)
              USBFSD->UEP3_CTRL_H = USBFSD->UEP3_CTRL_H & ~(USBFS_UEP_R_TOG | USBFS_UEP_R_RES_MASK) | USBFS_UEP_R_RES_ACK;
              #endif
            break;
            case 0x82:
              #if defined (CH573) || defined (CH572)
              R8_UEP2_CTRL = R8_UEP2_CTRL & ~(RB_UEP_T_TOG | MASK_UEP_T_RES) | UEP_T_RES_NAK;
              #elif defined (CH585)
              R8_U2EP2_TX_CTRL = USBHS_UEP_T_RES_NAK;
              #elif defined (CH32X035)
              USBFSD->UEP2_CTRL_H = USBFSD->UEP2_CTRL_H & ~(USBFS_UEP_T_TOG | USBFS_UEP_T_RES_MASK) | USBFS_UEP_T_RES_NAK;
              #endif
            break;
            case 0x02:
              #if defined (CH573) || defined (CH572)
              R8_UEP2_CTRL = R8_UEP2_CTRL & ~(RB_UEP_R_TOG | MASK_UEP_R_RES) | UEP_R_RES_ACK;
              #elif defined (CH585)
              R8_U2EP2_RX_CTRL = USBHS_UEP_R_RES_ACK;
              #elif defined (CH32X035)
              USBFSD->UEP2_CTRL_H = USBFSD->UEP2_CTRL_H & ~(USBFS_UEP_R_TOG | USBFS_UEP_R_RES_MASK) | USBFS_UEP_R_RES_ACK;
              #endif
            break;
            case 0x81:
              #if defined (CH573) || defined (CH572)
              R8_UEP1_CTRL = R8_UEP1_CTRL & ~(RB_UEP_T_TOG | MASK_UEP_T_RES) | UEP_T_RES_NAK;
              #elif defined (CH585)
              R8_U2EP1_TX_CTRL = USBHS_UEP_T_RES_NAK;
              #elif defined (CH32X035)
              USBFSD->UEP1_CTRL_H = USBFSD->UEP1_CTRL_H & ~(USBFS_UEP_T_TOG | USBFS_UEP_T_RES_MASK) | USBFS_UEP_T_RES_NAK;
              #endif
            break;
            case 0x01:
              #if defined (CH573) || defined (CH572)
              R8_UEP1_CTRL = R8_UEP1_CTRL & ~(RB_UEP_R_TOG | MASK_UEP_R_RES) | UEP_R_RES_ACK;
              #elif defined (CH585)
              R8_U2EP1_RX_CTRL = USBHS_UEP_R_RES_ACK;
              #elif defined (CH32X035)
              USBFSD->UEP1_CTRL_H = USBFSD->UEP1_CTRL_H & ~(USBFS_UEP_R_TOG | USBFS_UEP_R_RES_MASK) | USBFS_UEP_R_RES_ACK;
              #endif
            break;
          default:
            len = 0xFF; // Unsupported endpoint
            break;
          }
        } else {
          len = 0xFF; // Unsupported for non-endpoint
        }
        break;
      case USB_SET_FEATURE: // Set Feature
        if ((UsbSetupBuf->bRequestType & 0x1F) ==
            USB_REQ_RECIP_DEVICE) // Set  the device featuee.
        {
          if ((((uint16_t)UsbSetupBuf->wValueH << 8) | UsbSetupBuf->wValueL) ==
              0x01) {
            if (CfgDesc[ 7 ] & 0x20) {
              // suspend

              // while ( XBUS_AUX & bUART0_TX );    //Wait till uart0 sending
              // complete SAFE_MOD = 0x55; SAFE_MOD = 0xAA; WAKE_CTRL =
              // bWAK_BY_USB | bWAK_RXD0_LO | bWAK_RXD1_LO; //wake up by USB or
              // RXD0/1 signal PCON |= PD; //sleep SAFE_MOD = 0x55; SAFE_MOD =
              // 0xAA; WAKE_CTRL = 0x00;
            } else {
              len = 0xFF; // Failed
            }
          } else {
            len = 0xFF; // Failed
          }
        } else if ((UsbSetupBuf->bRequestType & 0x1F) ==
                    USB_REQ_RECIP_ENDP) // endpoint
        {
          if ((((uint16_t)UsbSetupBuf->wValueH << 8) | UsbSetupBuf->wValueL) ==
              0x00) {
            switch (((uint16_t)UsbSetupBuf->wIndexH << 8) |
                    UsbSetupBuf->wIndexL) {
            case 0x84:
              #if defined (CH573) || defined (CH572)
              R8_UEP4_CTRL = R8_UEP4_CTRL & (~RB_UEP_T_TOG) |
                            UEP_T_RES_STALL; // Set endpoint4 IN STALL
              #elif defined (CH585)
              R8_U2EP4_TX_CTRL = ( R8_U2EP4_TX_CTRL & ~USBHS_UEP_T_RES_MASK ) | USBHS_UEP_T_RES_STALL;

