DeqingSun/arduino_core_ch32/libraries/SimpleUsbSerial/src/USBhandler.c
void USB_EP0_IN(){
    switch(SetupReq)
    {
        case USB_GET_DESCRIPTOR:
        {
            uint8_t len = SetupLen >= DEFAULT_ENDP0_SIZE ? DEFAULT_ENDP0_SIZE : SetupLen;                                 //send length
            for (uint8_t i=0;i<len;i++){
                Ep0Buffer[i] = pDescr[i];
            }
            //memcpy( Ep0Buffer, pDescr, len );                                  
            SetupLen -= len;
            pDescr += len;
            #if defined (CH573) || defined (CH572)
            R8_UEP0_T_LEN = len;
            R8_UEP0_CTRL ^= RB_UEP_T_TOG;                    //Switch between DATA0 and DATA1
            #elif defined (CH585)
            R16_U2EP0_T_LEN = len;
            R8_U2EP0_TX_CTRL ^= USBHS_UEP_T_TOG_DATA1;                    //Switch between DATA0 and DATA1
            R8_U2EP0_TX_CTRL = ( R8_U2EP0_TX_CTRL & ~USBHS_UEP_T_RES_MASK) | USBHS_UEP_T_RES_ACK;
            // if( USBHS_SetupReqLen == 0 ){
            //    R8_U2EP0_RX_CTRL = USBHS_UEP_R_TOG_DATA1 | USBHS_UEP_R_RES_ACK;
            // }
            #elif defined (CH32X035)
            USBFSD->UEP0_TX_LEN = len;
            USBFSD->UEP0_CTRL_H ^= USBFS_UEP_T_TOG;                    //Switch between DATA0 and DATA1
            #endif
        }
            break;
        case USB_SET_ADDRESS:
            #if defined (CH573) || defined (CH572)
            R8_USB_DEV_AD = R8_USB_DEV_AD & RB_UDA_GP_BIT | SetupLen;
            R8_UEP0_CTRL = UEP_R_RES_ACK | UEP_T_RES_NAK;
            #elif defined (CH585)
            R8_USB2_DEV_AD = SetupLen;
            R8_U2EP0_TX_CTRL = USBHS_UEP_T_RES_NAK;
            R8_U2EP0_RX_CTRL = USBHS_UEP_R_RES_ACK;
            #elif defined (CH32X035)
            USBFSD->DEV_ADDR = USBFSD->DEV_ADDR & USBFS_UDA_GP_BIT | SetupLen;
            USBFSD->UEP0_CTRL_H = USBFS_UEP_R_RES_ACK | USBFS_UEP_T_RES_NAK;
            #endif
            break;
        default:
            #if defined (CH573) || defined (CH572)
            R8_UEP0_T_LEN = 0;                                                      // End of transaction
            R8_UEP0_CTRL = UEP_R_RES_ACK | UEP_T_RES_NAK;
            #elif defined (CH585)
            R16_U2EP0_T_LEN = 0;
            R8_U2EP0_TX_CTRL = USBHS_UEP_T_RES_NAK;
            R8_U2EP0_RX_CTRL = USBHS_UEP_R_RES_ACK;
            #elif defined (CH32X035)
            USBFSD->UEP0_TX_LEN = 0;                                                      // End of transaction
            USBFSD->UEP0_CTRL_H = USBFS_UEP_R_RES_ACK | USBFS_UEP_T_RES_NAK;
            #endif
            break;
    }
    R8_U2EP0_TX_CTRL &= ~USBHS_UEP_T_DONE;
}

void USB_EP0_OUT(){
    if(SetupReq ==SET_LINE_CODING)  //Set line coding
    {
      #if defined (CH573) || defined (CH572)
        if( R8_USB_INT_FG & RB_U_TOG_OK ){
      #elif defined (CH585)
        // CH585 does not have RB_U_TOG_OK
        {
      #elif defined (CH32X035)
        if( USBFSD->INT_ST & USBFS_UIS_TOG_OK ){
      #endif
          setLineCodingHandler();
          #if defined (CH573) || defined (CH572)
          R8_UEP0_T_LEN = 0;
          R8_UEP0_CTRL |= UEP_R_RES_ACK | UEP_T_RES_ACK;  // send 0-length packet
          #elif defined (CH585)
          R16_U2EP0_T_LEN = 0;
          R8_U2EP0_TX_CTRL = USBHS_UEP_T_RES_ACK;
          R8_U2EP0_RX_CTRL = USBHS_UEP_R_RES_ACK;
          #elif defined (CH32X035)
          USBFSD->UEP0_TX_LEN = 0;
          USBFSD->UEP0_CTRL_H |= USBFS_UEP_R_RES_ACK | USBFS_UEP_T_RES_ACK;  // send 0-length packet
          #endif
        }
    }
    else
    {
      #if defined (CH573) || defined (CH572)
        R8_UEP0_T_LEN = 0;
        R8_UEP0_CTRL |= UEP_R_RES_ACK | UEP_T_RES_NAK;  //Respond Nak
      #elif defined (CH585)
        R16_U2EP0_T_LEN = 0;
        R8_U2EP0_TX_CTRL = USBHS_UEP_T_RES_NAK;
        R8_U2EP0_RX_CTRL = USBHS_UEP_R_RES_ACK;
      #elif defined (CH32X035)
        USBFSD->UEP0_TX_LEN = 0;
        USBFSD->UEP0_CTRL_H |= USBFS_UEP_R_RES_ACK | USBFS_UEP_T_RES_NAK;  //Respond Nak
      #endif
    }
    R8_U2EP0_RX_CTRL &= ~USBHS_UEP_R_DONE;
}

void USB_EP1_IN() {
#if defined (CH573) || defined (CH572)
    R8_UEP1_T_LEN = 0;
    R8_UEP1_CTRL = R8_UEP1_CTRL & ~MASK_UEP_T_RES | UEP_T_RES_NAK; // Default NAK
#elif defined (CH32X035)
    USBFSD->UEP1_TX_LEN = 0;
    USBFSD->UEP1_CTRL_H = USBFSD->UEP1_CTRL_H & ~USBFS_UEP_T_RES_MASK | USBFS_UEP_T_RES_NAK; // Default NAK
#endif
}

__attribute__((interrupt("WCH-Interrupt-fast")))
__attribute__((section(".highcode")))
#if defined (CH573) || defined (CH572)
void USB_IRQHandler(void) {
#elif defined (CH585)
void USB2_DEVICE_IRQHandler(void) {
#elif defined (CH32X035)
void USBFS_IRQHandler(void) {
#endif

#if defined (CH573) || defined (CH572)
  if (R8_USB_INT_FG & RB_UIF_TRANSFER) {
#elif defined (CH585)
  if (R8_USB2_INT_FG & USBHS_UDIF_TRANSFER) {
#elif defined (CH32X035)
  if (USBFSD->INT_FG & USBFS_UIF_TRANSFER) {
#endif
    // there is difference in CH573 from CH552, there is RB_UIS_SETUP_ACT on bit7 of R8_USB_INT_ST
    // and it does not affect RB_UIS_TOG_OK, MASK_UIS_TOKEN , MASK_UIS_ENDP and R8_USB_RX_LEN
#if defined (CH573) || defined (CH572)
    if (R8_USB_INT_ST & RB_UIS_SETUP_ACT) {
#elif defined (CH585)
    // CH585 has RB_UEP_R_SETUP_IS in R8_U2EP0_RX_CTRL
    if ( ((R8_USB2_INT_ST & (USBHS_UDIS_EP_ID_MASK | USBHS_UDIS_EP_DIR)) == 0) && (R8_U2EP0_RX_CTRL & USBHS_UEP_R_SETUP_IS) ) {
#elif defined (CH32X035)
    if (USBFSD->INT_ST & USBFS_SETUP_ACT) {
#endif
        EP0_SETUP_Callback();
    }else{
#if defined (CH573) || defined (CH572)
        uint8_t callIndex = R8_USB_INT_ST & MASK_UIS_ENDP;
        switch (R8_USB_INT_ST & MASK_UIS_TOKEN) {
#elif defined (CH585)
        uint8_t callIndex = R8_USB2_INT_ST & USBHS_UDIS_EP_ID_MASK;
        switch ((R8_USB2_INT_ST & USBHS_UDIS_EP_DIR) | (R8_USB2_INT_FG & USBHS_UDIF_RX_SOF & 0)) {
#elif defined (CH32X035)
        uint8_t callIndex = USBFSD->INT_ST & USBFS_UIS_ENDP_MASK;
        switch (USBFSD->INT_ST & USBFS_UIS_TOKEN_MASK) {
#endif

#if defined (CH573) || defined (CH572)
          case UIS_TOKEN_OUT:
#elif defined (CH585)
          case 0: //RB_UDIS_EP_DIR is 0
#elif defined (CH32X035)
          case USBFS_UIS_TOKEN_OUT:
#endif
            {  // SDCC will take IRAM if array of function pointer is
               // used.
              switch (callIndex) {
                case 0:
                  EP0_OUT_Callback();
                  break;
                case 1:
                  EP1_OUT_Callback();
                  break;
                case 2:
                  EP2_OUT_Callback();
                  break;
                case 3:
                  EP3_OUT_Callback();
                  break;
                case 4:
                  EP4_OUT_Callback();
                  break;
                default:
                  break;
              }
            }
            break;
#if defined (CH573) || defined (CH572)
          case UIS_TOKEN_SOF:
#elif defined (CH585)
          case 0xFFFF: //USBHS_UDIF_RX_SOF seems not used in EVT example
#elif defined (CH32X035)
          case USBFS_UIS_TOKEN_SOF:
#endif
            {  // SDCC will take IRAM if array of function pointer is
               // used.
              switch (callIndex) {
                case 0:
                  EP0_SOF_Callback();
                  break;
                case 1:
                  EP1_SOF_Callback();
                  break;
                case 2:
                  EP2_SOF_Callback();
                  break;
                case 3:
                  EP3_SOF_Callback();
                  break;
                case 4:
                  EP4_SOF_Callback();
                  break;
                default:
                  break;
              }
              R8_USB2_INT_FG = USBHS_UDIF_RX_SOF;  // Clear SOF interrupt flag
            }
            break;
#if defined (CH573) || defined (CH572)
          case UIS_TOKEN_IN:
#elif defined (CH585)
          case USBHS_UDIS_EP_DIR: // RB_UDIS_EP_DIR is 1
#elif defined (CH32X035)
          case USBFS_UIS_TOKEN_IN:
#endif
            {  // SDCC will take IRAM if array of function pointer is
               // used.
              switch (callIndex) {
                case 0:
                  EP0_IN_Callback();
                  break;
                case 1:
                  EP1_IN_Callback();
                  break;
                case 2:
                  EP2_IN_Callback();
                  break;
                case 3:
                  EP3_IN_Callback();
                  break;
                case 4:
                  EP4_IN_Callback();
                  break;
                default:
                  break;
              }
            }
            break;
        }
    }
#if defined (CH573) || defined (CH572)
    R8_USB_INT_FG = RB_UIF_TRANSFER;  // Clear interrupt flag
#elif defined (CH585)
    R8_USB2_INT_FG = USBHS_UDIF_TRANSFER;  // Clear interrupt flag
#elif defined (CH32X035)
    USBFSD->INT_FG = USBFS_UIF_TRANSFER;  // Clear interrupt flag
#endif
  }

#if defined (CH585)
  if( R8_USB2_INT_FG & USBHS_UDIF_LINK_RDY ){
    R8_USB2_INT_FG = USBHS_UDIF_LINK_RDY;
  }
#endif

