DeqingSun/arduino_core_ch32/libraries/SimpleUsbSerial/src/USBhandler.c
    // Device mode USB bus reset
#if defined (CH573) || defined (CH572)
    if (R8_USB_INT_FG & RB_UIF_BUS_RST){
#elif defined (CH585)
    if (R8_USB2_INT_FG & USBHS_UDIF_BUS_RST){
#elif defined (CH32X035)
    if (USBFSD->INT_FG & USBFS_UIF_BUS_RST){
#endif

        //!!!!!!!!!!!! add CH585 reset bus here, need to confirm if it is same as CH573/572!!!!!!!!!!!
        // Manual flip, OUT transaction returns
        // ACK, IN transaction returns NAK
        #if defined (CH573) || defined (CH572)
          R8_UEP0_CTRL = UEP_R_RES_ACK | UEP_T_RES_NAK;
        #elif defined (CH585)
          R16_U2EP0_T_LEN  = 0;
          R8_U2EP0_TX_CTRL = USBHS_UEP_T_RES_NAK;
          R8_U2EP0_RX_CTRL = USBHS_UEP_R_RES_ACK;
        #elif defined (CH32X035)
          USBFSD->UEP0_CTRL_H = USBFS_UEP_R_RES_ACK | USBFS_UEP_T_RES_NAK;
        #endif
        // Endpoint 1 automatically flips the sync flag,
        // IN transaction returns NAK
        #if defined (CH573) || defined (CH572)
          R8_UEP1_CTRL = RB_UEP_AUTO_TOG | UEP_T_RES_NAK;
        #elif defined (CH585)
          R8_U2EP1_TX_CTRL = USBHS_UEP_T_RES_NAK;
        #elif defined (CH32X035)
          USBFSD->UEP1_CTRL_H = USBFS_UEP_T_AUTO_TOG | USBFS_UEP_T_RES_NAK;
        #endif
        // Endpoint 2 automatically flips the sync flag, IN
        // transaction returns NAK, OUT transaction returns ACK
        #if defined (CH573) || defined (CH572)
          R8_UEP2_CTRL = RB_UEP_AUTO_TOG | UEP_T_RES_NAK | UEP_R_RES_ACK;
        #elif defined (CH585)
          R8_U2EP2_TX_CTRL = USBHS_UEP_T_RES_NAK;
          R8_U2EP2_RX_CTRL = USBHS_UEP_R_RES_ACK;
        #elif defined (CH32X035)
          USBFSD->UEP2_CTRL_H = USBFS_UEP_T_AUTO_TOG | USBFS_UEP_T_RES_NAK | USBFS_UEP_R_RES_ACK;
        #endif

        #if defined (CH573) || defined (CH572)
        R8_USB_DEV_AD = 0x00;
        R8_USB_INT_FG = RB_UIF_SUSPEND|RB_UIF_TRANSFER|RB_UIF_BUS_RST; // Clear interrupt flag
        #elif defined (CH585)
        R8_USB2_DEV_AD = 0;
        R8_USB2_INT_FG = USBHS_UDIF_BUS_RST;
        #elif defined (CH32X035)
        USBFSD->DEV_ADDR = 0x00;
        USBFSD->INT_FG = USBFS_UIF_SUSPEND|USBFS_UIF_TRANSFER|USBFS_UIF_BUS_RST; // Clear interrupt flag
        #endif

        UsbConfig = 0;

        resetCDCParameters();
    }

    // USB bus suspend / wake up
#if defined (CH573) || defined (CH572)
    if (R8_USB_INT_FG & RB_UIF_SUSPEND) {
#elif defined (CH585)
    if (R8_USB2_INT_FG & USBHS_UDIF_SUSPEND) {
#elif defined (CH32X035)
    if (USBFSD->INT_FG & USBFS_UIF_SUSPEND) {
#endif

#if defined (CH573) || defined (CH572)
        R8_USB_INT_FG = RB_UIF_SUSPEND; // Clear interrupt flag
#elif defined (CH585)
        R8_USB2_INT_FG = USBHS_UDIF_SUSPEND; // Clear interrupt flag
#elif defined (CH32X035)
        USBFSD->INT_FG = USBFS_UIF_SUSPEND; // Clear interrupt flag
#endif

#if defined (CH573) || defined (CH572)
        if (R8_USB_MIS_ST & RB_UMS_SUSPEND) { // Suspend
#elif defined (CH585)
        if (R8_USB2_MIS_ST & USBHS_UDMS_SUSPEND) { // Suspend
#elif defined (CH32X035)
        if (USBFSD->MIS_ST & USBFS_UMS_SUSPEND) { // Suspend
#endif
            //don't need to do anything
        }else{
            //don't need to do anything
        }
    }
}

